app/Controllers/Post.php

SELECT *
FROM `artikel`
ORDER BY `id` DESC
---
    public function index()
    {
        $model = new ArtikelModel();
        $data['artikel'] = $model->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `artikel`
WHERE `id` = '2'
 LIMIT 1
---
    public function show($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->first();

DELETE FROM `artikel`
WHERE `id` = '4'
AND `id` IN ('4')
DELETE FROM `artikel`
WHERE `id` IN ('4')
---
    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->delete($id);
        if ($data) {
            $model->delete($id);